tutorials/YouTube-Tutorials-master/shinkansen/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.02 0 -12)  //0
    (0 0 -12)  //1
    (0 3 -12)  //2
    (-0.02 3 -12) //3
    (-0.02 0 2)  //4
    (0 0 2)  //5
    (0 3 2)  //6
    (-0.02 3 2)  //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 20 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
         
    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }
    
    inlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
